sobey-projects/cmdbuild/src/test/java/viewWSformat.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:insertIPAddress xmlns:ns2="http://cmdbuild.sobey.com">
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code1091</code>
				<description>description7819</description>
				<gateway>gateway1785</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask4672</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code9680</code>
				<description>description9426</description>
				<gateway>gateway5559</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask8521</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code145</code>
				<description>description6454</description>
				<gateway>gateway2855</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask9769</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code265</code>
				<description>description1781</description>
				<gateway>gateway6118</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask8625</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code9724</code>
				<description>description6541</description>
				<gateway>gateway7835</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask1300</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code9739</code>
				<description>description5418</description>
				<gateway>gateway4106</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask6194</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code6926</code>
				<description>description6525</description>
				<gateway>gateway9014</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask7462</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code9965</code>
				<description>description2184</description>
				<gateway>gateway9378</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask4329</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code4202</code>
				<description>description3365</description>
				<gateway>gateway4984</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask9634</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
			<ipaddressDTOList>
				<beginDate>2013-11-14T22:40:35.991+08:00</beginDate>
				<code>code7902</code>
				<description>description455</description>
				<gateway>gateway2371</gateway>
				<id>0</id>
				<ipAddressPool>46</ipAddressPool>
				<ipAddressStatus>49</ipAddressStatus>
				<isp>44</isp>
				<netmask>netMask5483</netmask>
				<vlan>91</vlan>
			</ipaddressDTOList>
		</ns2:insertIPAddress>
	</soap:Body>
</soap:Envelope>
